print('-------------------Задание 1------------------')
print('Hello, World!') 
print('Маша + Петя = Любовь')
print('x=3+4')
x = 3+4
print('x =', x)

print('-------------------Задание 2------------------')

x='Hello, World!'
print(type(x))
x=3+4
print(type(x))
x=3/4
print(type(x))
x=[1,2,5,10,100]
print(type(x))

print('-------------------Задание 3------------------')
x=3
print('x =', x)
y=(x/(x**3+(3/x)))*(4*x**7-x**5)+80*((27*x**4+12*x**3-5*x**2+10)**0.5)
print('y=', y)
y=((3/2)%1+(16.7*4.32)//1)/(14.5+((31/12)%1)-(x**3.4)//1)
print('y=', y)

print('-------------------Задание 4------------------')
a=[1, 5, 'Good', 'Bad']
b=[9, 'Blue', 'Red', 11]
c=a[0]+b[3]
print('1=', c)
c=a[2]+b[2]
print('2=', c)
c=a[0]*b[0]
print('3=', c)
c=a[1]**b[3]
print('4=', c)
c=a+b
print('5=', c)


